Revit 2026 API

# FloorFloorType Property

---

Retrieves/sets an object that represents the type of the floor.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FloorType FloorType { get; set; }
```
```vb
Public Property FloorType As FloorType
	Get
	Set
```
```cpp
public:
property FloorType^ FloorType {
	FloorType^ get ();
	void set (FloorType^ value);
}
```
```fsharp
member FloorType : FloorType with get, set
```

#### Property Value

FloorType

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: Floor type is not valid for this floor. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The floor type can be used to access the multi layered structure of a floor.

#### Reference

Floor Class

Autodesk.Revit.DB Namespace